<?php

echo <<<'TASK'
<b>Задание 1.</b><br />
Дан массив [[399, 9160, 144, 3230, 407, 8875, 1597, 9835], [2093, 3279, 21, 9038, 918, 9238, 2592, 7467], [3531, 1597, 3225, 153, 9970, 2937, 8, 807], [7010, 662, 6005, 4181, 3, 4606, 5, 3980], [6367, 2098, 89, 13, 337, 9196, 9950, 5424], [7204, 9393, 7149, 8, 89, 6765, 8579, 55], [1597, 4360, 8625, 34, 4409, 8034, 2584, 2], [920, 3172, 2400, 2326, 3413, 4756, 6453, 8], [4914, 21, 4923, 4012, 7960, 2254, 4448, 1]]. Среди его ячеек некоторые числа явлвяются простыми числами. Найдите сумму простых чисел в этом массиве.
<br /> <br />
TASK;

    $array = [[399, 9160, 144, 3230, 407, 8875, 1597, 9835], [2093, 3279, 21, 9038, 918, 9238, 2592, 7467], [3531, 1597, 3225, 153, 9970, 2937, 8, 807], [7010, 662, 6005, 4181, 3, 4606, 5, 3980], [6367, 2098, 89, 13, 337, 9196, 9950, 5424], [7204, 9393, 7149, 8, 89, 6765, 8579, 55], [1597, 4360, 8625, 34, 4409, 8034, 2584, 2], [920, 3172, 2400, 2326, 3413, 4756, 6453, 8], [4914, 21, 4923, 4012, 7960, 2254, 4448, 1]];
// функция проверки числа на простое
    function isSimple($number)
{
        if ($number==2)
                    return true;
        if ($number%2==0)
            return false;
        if ($number==1)
            return false;
        $i=3;
        while ($i<$number){
            if ($number%$i == 0)
                return false;
            $i+=2;
        }
        return true;
}
// проверяем все элементы массива на простоту, а затем если число из массива простое добавляем его в массив простых чисел $simple
    $simple = [];
    foreach($array as $value) {
        foreach($value as $val) {
                if (isSimple($val)) {
                    $simple[] = $val;
                }
        }
    }

echo "Все вычисленные простые числа из заданного массива: ";
foreach($simple as $value) {
    echo $value . "  ";
}

echo "<br />" . "<br />";
echo "Сумма всех вычисленных простых чисел из заданного массива: ";

$summ = 0;
foreach($simple as $value) {
    $summ += $value;
}

echo $summ;